Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig_ship.c
/*
    梦幻之星中国

    版权 (C) 2009, 2010, 2011, 2012, 2013, 2016, 2017, 2018, 2019,
                  2020 Sancaros

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU Affero General Public License version 3
    as published by the Free Software Foundation.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Affero General Public License for more details.

    You should have received a copy of the GNU Affero General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <limits.h>
#include <errno.h>

#include "WinSock_Defines.h"

#include <libxml/xmlwriter.h>
#include <libxml/tree.h>
#include <libxml/parser.h>
#include <libxml/xmlstring.h>

#include "psoconfig.h"
#include "f_logs.h"
#include "f_iconv.h"
#include "debug.h"

#ifndef LIBXML_TREE_ENABLED
#error You must have libxml2 with tree support built-in.
#endif

#define XC (const xmlChar *)

/* The list of language codes */
#define LANGUAGE_CODE_COUNT     8

//static const char language_codes[LANGUAGE_CODE_COUNT][3] = {
//    "jp", "en", "de", "fr", "es", "cs", "ct", "kr"
//};

static const char language_codes[LANGUAGE_CODE_COUNT][3] = {
    "cn", "tc", "jp", "en", "de", "fr", "es", "kr"
};

static int handle_shipgate(xmlNode* n, psocn_ship_t* cfg) {
    xmlChar* proto_ver, * addr, * ip, * port, * key, * cert, * ca;
    int rv;
    unsigned long rv2;
    uint32_t ip4 = 0;
    uint8_t ip6[16] = { 0 };

    /* Grab the attributes of the tag. */
    proto_ver = xmlGetProp(n, XC"proto_ver");
    addr = xmlGetProp(n, XC"addr");
    ip = xmlGetProp(n, XC"ip");
    port = xmlGetProp(n, XC"port");
    key = xmlGetProp(n, XC"key");
    cert = xmlGetProp(n, XC"cert");
    ca = xmlGetProp(n, XC"ca-cert");

    //ERR_LOG("handle_shipgate %s %s %s %s", (char*)ip, (char*)port, (char*)ca, (char*)addr);

    /* Make sure we have all of them... */
    if (!port || !key || !cert || !ca) {
        ERR_LOG("必须为船闸设置端口和ca");
        rv = -1;
        goto err;
    }
    else if (!addr && !ip) {
        ERR_LOG("必须为船闸设置ip或addr");
        rv = -4;
        goto err;
    }

    /* Parse the address address out */
    if (addr) {
        cfg->shipgate_host = (char*)addr;
    }
    else if (ip) {
        rv = inet_pton(PF_INET, (char*)ip, &ip4);

        if (rv < 1) {
            rv = inet_pton(PF_INET6, (char*)ip, ip6);

            if (rv < 1) {
                ERR_LOG("船闸设置的IP无效: %s",
                    (char*)ip);
                rv = -2;
                goto err;
            }
        }

        cfg->shipgate_host = (char*)ip;
    }

    /* 分析设置端口参数 */
    rv2 = strtoul((char*)port, NULL, 0);

    if (rv2 == 0 || rv2 > 0xFFFF) {
        ERR_LOG("船闸设置的端口无效: %s", (char*)port);
        rv = -3;
        goto err;
    }

    cfg->shipgate_port = (uint16_t)rv2;
    cfg->shipgate_proto_ver = strtoul((char*)proto_ver, NULL, 0);


    cfg->ship_key = (char*)key;
    cfg->ship_cert = (char*)cert;
    cfg->shipgate_ca = (char*)ca;
    rv = 0;

err:
    xmlFree(proto_ver);
    xmlFree(port);

    if (rv) {
        xmlFree(addr);
        xmlFree(ip);
        xmlFree(key);
        xmlFree(cert);
        xmlFree(ca);
    }

    return rv;
}

static int handle_net(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* addr4, * addr6, * ip4, * ip6, * port;
    int rv;
    unsigned long rv2;
    //uint32_t tmpip4;
    //uint8_t tmpip6[16];

    /* Grab the attributes of the tag. */
    addr4 = xmlGetProp(n, XC"addr4");
    addr6 = xmlGetProp(n, XC"addr6");
    ip4 = xmlGetProp(n, XC"ip4");
    ip6 = xmlGetProp(n, XC"ip6");
    port = xmlGetProp(n, XC"port");

    /* Make sure we have both of the required ones... */
    if (!port) {
        ERR_LOG("舰船端口未设置");
        rv = -1;
        goto err;
    }
    else if (!ip4 && !addr4) {
        ERR_LOG("必须为舰船设置一个IP或域名");
        rv = -4;
        goto err;
    }
    else if (!ip6 && !addr6) {
        ERR_LOG("必须为舰船设置一个IPv6或域名6");
        rv = -5;
        goto err;
    }

    cur->ship_host4 = (char*)addr4;

    //CONFIG_LOG("检测域名获取: %s", host4);

    if (check_ipaddr((char*)ip4)) {
        /* Parse the IP address out */
        if (NULL != ip4) {
            rv = inet_pton(PF_INET, (char*)ip4, &cur->ship_ip4);

            if (rv < 1) {
                ERR_LOG("未获取到正确的 IP 地址: %s",
                    (char*)ip4);
                rv = -2;
                goto err;
            }
        }
    }

    /* 分析设置端口参数 */
    rv2 = strtoul((char*)port, NULL, 0);

    if (rv2 == 0 || rv2 > 0xFFFF) {
        ERR_LOG("无效舰船端口: %s", (char*)port);
        rv = -3;
        goto err;
    }

    cur->base_port = (uint16_t)rv2;

    /* See if we have a configured IPv6 address */
    if (ip6 || addr6) {

        cur->ship_host6 = (char*)addr6;

        if (ip6) {
            rv = inet_pton(PF_INET6, (char*)ip6, cur->ship_ip6);

            /* This isn't actually fatal, for now, anyway. */
            if (rv < 1) {
                //ERR_LOG("无效舰船 IPv6 地址: %s", (char*)ip6);
            }
        }
    }

    rv = 0;

err:
    xmlFree(port);

    if (rv) {
        xmlFree(ip4);
        xmlFree(ip6);
        xmlFree(addr4);
        xmlFree(addr6);
    }

    return rv;
}

static int handle_event_old(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* game, * lobby;
    int rv;
    long rv2;

    /* Make sure we don't already have an event setup done... */
    if (cur->event_count != 0) {
        ERR_LOG("xml行 %hu 忽略 <event> 设置标签", n->line);
        return 0;
    }

    /* Grab the attributes of the tag. */
    game = xmlGetProp(n, XC"game");
    lobby = xmlGetProp(n, XC"lobby");

    /* Make sure we have the data */
    if (!game || !lobby) {
        ERR_LOG("节日事件数字未填写");
        rv = -1;
        goto err;
    }

    /* Parse the game event out */
    errno = 0;
    rv2 = strtol((char*)game, NULL, 0);

