Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig_ship.c
    if (errno || rv2 > 6 || rv2 < 0) {
        ERR_LOG("舰船房间节日事件无效: %s",
            (char*)game);
        rv = -2;
        goto err;
    }

    cur->events[0].game_event = (uint8_t)rv2;

    /* Parse the lobby event out */
    rv2 = strtol((char*)lobby, NULL, 0);

    if (errno || rv2 > 14 || rv2 < 0) {
        ERR_LOG("舰船大厅节日事件无效: %s",
            (char*)lobby);
        rv = -3;
        goto err;
    }

    cur->events[0].lobby_event = (uint8_t)rv2;
    rv = 0;
    cur->event_count = 1;

err:
    xmlFree(game);
    xmlFree(lobby);
    return rv;
}

static int handle_event_date(xmlNode* n, uint8_t* m, uint8_t* d) {
    xmlChar* month, * day;
    int rv;

    /* Grab the attributes of the tag. */
    month = xmlGetProp(n, XC"month");
    day = xmlGetProp(n, XC"day");

    /* Make sure we have the data */
    if (!month || !day) {
        ERR_LOG("Event timeframe not specified properly");
        rv = -1;
        goto err;
    }

    /* Parse the game event out */
    errno = 0;
    *m = (uint8_t)strtoul((char*)month, NULL, 0);

    if (errno || *m > 12 || *m < 1) {
        ERR_LOG("Invalid month given: %s", (char*)month);
        rv = -3;
        goto err;
    }

    /* Parse the lobby event out */
    *d = (uint8_t)strtoul((char*)day, NULL, 0);

    if (errno || *d < 1) {
        ERR_LOG("Invalid day given: %s", (char*)day);
        rv = -4;
        goto err;
    }

    /* Check the day for validity */
    if (*m == 4 || *m == 6 || *m == 9 || *m == 11) {
        if (*d > 30) {
            ERR_LOG("Invalid day given (month = %d): %d", (int)*m,
                (int)*d);
            rv = -5;
            goto err;
        }
    }
    else if (*m == 2) {
        if (*d > 29) {
            ERR_LOG("Invalid day given (month = %d): %d", (int)*m,
                (int)*d);
            rv = -6;
            goto err;
        }
    }
    else {
        if (*d > 31) {
            ERR_LOG("Invalid day given (month = %d): %d", (int)*m,
                (int)*d);
            rv = -7;
            goto err;
        }
    }

    rv = 0;

err:
    xmlFree(day);
    xmlFree(month);
    return rv;
}

static int handle_event(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* game, * lobby;
    int rv;
    long rv2;
    int c = cur->event_count;
    void* tmp;
    xmlNode* n2;

    /* Make sure we already have an event setup started... */
    if (c < 1) {
        ERR_LOG("xml行 %hu 忽略 <event> 设置标签", n->line);
        return 0;
    }

    /* Grab the attributes of the tag. */
    game = xmlGetProp(n, XC"game");
    lobby = xmlGetProp(n, XC"lobby");

    /* Make sure we have the data */
    if (!game || !lobby) {
        ERR_LOG("节日事件数字未填写");
        rv = -1;
        goto err;
    }

    /* Allocate the space we need */
    tmp = realloc(cur->events, sizeof(psocn_event_t) * (c + 1));
    if (!tmp) {
        ERR_LOG("无法为节日事件分配内存空间: %s",
            strerror(errno));
        rv = -2;
        goto err;
    }

    cur->events = (psocn_event_t*)tmp;
    memset(&cur->events[c], 0, sizeof(psocn_event_t));

    /* Parse the game event out */
    errno = 0;
    rv2 = strtol((char*)game, NULL, 0);

    if (errno || rv2 > 6 || rv2 < -1) {
        ERR_LOG("舰船房间节日事件无效: %s",
            (char*)game);
        rv = -3;
        goto err;
    }

    cur->events[c].game_event = (uint8_t)rv2;

    /* Parse the lobby event out */
    rv2 = strtol((char*)lobby, NULL, 0);

    if (errno || rv2 > 14 || rv2 < -1) {
        ERR_LOG("舰船大厅节日事件无效: %s",
            (char*)lobby);
        rv = -4;
        goto err;
    }

    cur->events[c].lobby_event = (uint8_t)rv2;

    /* Parse out the children of the <event> tag. */
    n2 = n->children;
    while (n2) {
        if (n2->type != XML_ELEMENT_NODE) {
            /* Ignore non-elements. */
            n2 = n2->next;
            continue;
        }
        else if (!xmlStrcmp(n2->name, XC"start")) {
            if (handle_event_date(n2, &cur->events[c].start_month,
                &cur->events[c].start_day)) {
                rv = -5;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"end")) {
            if (handle_event_date(n2, &cur->events[c].end_month,
                &cur->events[c].end_day)) {
                rv = -6;
                goto err;
            }
        }
        else {
            ERR_LOG("xml行 %hu 无效设置标签 %s",
                n2->line, (char*)n2->name);
        }

        n2 = n2->next;
    }

    ++cur->event_count;
    rv = 0;

err:
    xmlFree(game);
    xmlFree(lobby);
    return rv;
}

static int handle_magnification(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* globla_exp_mult;
    int rv;
    long rv2;

    /* Grab the attributes of the tag. */
    globla_exp_mult = xmlGetProp(n, XC"globla_exp_mult");

    /* Make sure we have all of them... */
    if (!globla_exp_mult) {
        ERR_LOG("倍率设置不完整");
        rv = -1;
        goto err;
    }

    /* Parse the game event out */
    errno = 0;
    rv2 = strtol((char*)globla_exp_mult, NULL, 0);

    if (errno || rv2 > 100000 || rv2 < 0) {
        ERR_LOG("经验倍率无效: %s",
            (char*)globla_exp_mult);
        rv = -2;
        goto err;
    }

    cur->globla_exp_mult = rv2;

#ifdef DEBUG

    DBG_LOG("cur->globla_exp_mult %d", cur->globla_exp_mult);

#endif // DEBUG

    xmlFree(globla_exp_mult);
    return 0;

err:
    xmlFree(globla_exp_mult);
    return rv;
}

static int handle_info(xmlNode* n, psocn_ship_t* cur, int is_motd) {
    xmlChar* fn, * desc, * v1, * v2, * pc, * gc, * bb, * lang;
    void* tmp;
    int rv = 0, count = cur->info_file_count, i, done = 0;
    char* lasts = { 0 }, * token = { 0 };

    /* Grab the attributes of the tag. */
    fn = xmlGetProp(n, XC"file");
    desc = xmlGetProp(n, XC"desc");
    v1 = xmlGetProp(n, XC"v1");
    v2 = xmlGetProp(n, XC"v2");
    pc = xmlGetProp(n, XC"pc");
    gc = xmlGetProp(n, XC"gc");
    bb = xmlGetProp(n, XC"bb");
    lang = xmlGetProp(n, XC"languages");

    /* Make sure we have all of them... */
    if (!fn || (!desc && !is_motd)) {
        ERR_LOG("info/motd 设置不完整");
        rv = -1;
        goto err;
    }

    if (is_motd && desc) {
        ERR_LOG("motd 无需填写描述!");
        rv = -3;
        goto err;
    }

