Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig_ship.c
    /* Allocate space for the new description. */
    tmp = realloc(cur->info_files, (count + 1) * sizeof(psocn_info_file_t));
    if (!tmp) {
        ERR_LOG("无法为 info/motd 文件分配内存");
        perror("realloc");
        rv = -2;
        goto err;
    }

    cur->info_files = (psocn_info_file_t*)tmp;

    /* Copy the data in */
    cur->info_files[count].versions = 0;
    cur->info_files[count].filename = (char*)fn;
    cur->info_files[count].desc = (char*)desc;

    /* Fill in the applicable versions */
    if (!v1 || !xmlStrcmp(v1, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_V1;

    if (!v2 || !xmlStrcmp(v2, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_V2;

    if (!pc || !xmlStrcmp(pc, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_PC;

    if (!gc || !xmlStrcmp(gc, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_GC;

    if (!bb || !xmlStrcmp(gc, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_BB;

    /* Parse the languages string, if given. */
    if (lang) {
        token = strtok_s((char*)lang, ", ", &lasts);

        while (token) {
            for (i = 0; i < LANGUAGE_CODE_COUNT && !done; ++i) {
                if (!strcmp(token, language_codes[i])) {
                    cur->info_files[count].languages |= (1 << i);
                    done = 1;
                }
            }

            if (!done) {
                ERR_LOG("xml行 %hu 忽略未知 info/motd 语言标签: %s", n->line, token);
            }

            done = 0;
            token = strtok_s(NULL, ", ", &lasts);
        }
    }
    else {
        cur->info_files[count].languages = 0xFFFFFFFF;
    }

    ++cur->info_file_count;

    xmlFree(lang);
    xmlFree(gc);
    xmlFree(pc);
    xmlFree(v2);
    xmlFree(v1);

    return 0;

err:
    xmlFree(lang);
    xmlFree(gc);
    xmlFree(pc);
    xmlFree(v2);
    xmlFree(v1);
    xmlFree(fn);
    xmlFree(desc);
    return rv;
}

static int handle_quests(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->quests_dir = (char*)fn;
        return 0;
    }

    /* If not, see if we have the file attribute */
    if ((fn = xmlGetProp(n, XC"file"))) {
        cur->quests_file = (char*)fn;
        return 0;
    }

    /* If we don't have either, report the error */
    ERR_LOG("任务标记格式错误,未提供文件或目录");
    return -1;
}

static int handle_limits(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn, * name, * def, * id;
    int enf = 0, i;
    void* tmp;
    uint32_t idn = 0x7FFFFFFF;

    /* Grab the attributes of the tag. */
    id = xmlGetProp(n, XC"id");
    fn = xmlGetProp(n, XC"file");
    name = xmlGetProp(n, XC"name");
    def = xmlGetProp(n, XC"default");

    /* Make sure we have the data */
    if (!fn) {
        ERR_LOG("Limits file not given");
        goto err;
    }

    if ((!id && name) || (id && !name)) {
        ERR_LOG("Must give both or none of id and name for limits.");
        goto err;
    }

    if (def) {
        if (!xmlStrcmp(def, XC"true")) {
            enf = 1;
        }
        else if (xmlStrcmp(def, XC"false")) {
            ERR_LOG("Invalid default value for limits file: %s",
                (char*)def);
            goto err;
        }
    }
    /* This is really !id && !name, but per the above, if one is not set, then
       the other must not be set either, so this works. */
    else if (!id) {
        enf = 1;
    }

    if (id) {
        /* Parse the id out */
        idn = (uint32_t)strtoul((char*)id, NULL, 0);

        if (idn == 0 || idn > 0x7FFFFFFF) {
            ERR_LOG("Invalid id given for limits: %s", (char*)id);
            goto err;
        }

        /* Check for duplicate IDs. */
        for (i = 0; i < cur->limits_count; ++i) {
            if (cur->limits[i].id == idn) {
                ERR_LOG("Duplicate id given for limits: %s",
                    (char*)id);
                goto err;
            }
        }
    }

    /* Make sure we don't already have an default limits file. */
    if (enf && cur->limits_default != -1) {
        ERR_LOG("Cannot have more than one default limits file!");
        goto err;
    }

    /* Allocate space for it in the array. */
    if (!(tmp = realloc(cur->limits, (cur->limits_count + 1) *
        sizeof(psocn_limit_config_t)))) {
        ERR_LOG("分配动态内存给 limits file: %s",
            strerror(errno));
        goto err;
    }

    /* Copy it over to the struct */
    cur->limits = (psocn_limit_config_t*)tmp;
    cur->limits[cur->limits_count].id = idn;
    cur->limits[cur->limits_count].name = (char*)name;
    cur->limits[cur->limits_count].filename = (char*)fn;
    cur->limits[cur->limits_count].enforce = enf;

    if (enf)
        cur->limits_default = cur->limits_count;

    ++cur->limits_count;

    xmlFree(def);
    xmlFree(id);

    return 0;

err:
    xmlFree(id);
    xmlFree(fn);
    xmlFree(name);
    xmlFree(def);
    return -1;
}

static int handle_bans(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the attributes of the tag. */
    fn = xmlGetProp(n, XC"file");

    /* Make sure we have the data */
    if (!fn) {
        ERR_LOG("本地封禁列表文件缺失");
        return -1;
    }

    /* Copy it over to the struct */
    cur->bans_file = (char*)fn;

    return 0;
}

static int handle_scripts(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the attributes of the tag. */
    fn = xmlGetProp(n, XC"file");

    /* Make sure we have the data */
    if (!fn) {
        ERR_LOG("Scripts 文件名称未填写");
        return -1;
    }

    /* Copy it over to the struct */
    cur->scripts_file = (char*)fn;

    return 0;
}

static int handle_versions(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* v1, * v2, * pc, * gc, * ep3, * bb, * dcnte, * xb, * pcnte;
    int rv = 0;

    /* Grab the attributes of the tag. */
    v1 = xmlGetProp(n, XC"v1");
    v2 = xmlGetProp(n, XC"v2");
    pc = xmlGetProp(n, XC"pc");
    gc = xmlGetProp(n, XC"gc");
    ep3 = xmlGetProp(n, XC"ep3");
    bb = xmlGetProp(n, XC"bb");
    dcnte = xmlGetProp(n, XC"dcnte");
    xb = xmlGetProp(n, XC"xbox");
    pcnte = xmlGetProp(n, XC"pcnte");

    /* Make sure we have the data */
    if (!v1 || !v2 || !pc || !gc || !ep3) {
        ERR_LOG("缺少所需版本");
        rv = -1;
        goto err;
    }

