Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig_ship.c
    /* Parse everything out */
    if (!xmlStrcmp(v1, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOV1;

    if (!xmlStrcmp(v2, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOV2;

    if (!xmlStrcmp(pc, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOPC;

    if (!xmlStrcmp(gc, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOEP12;

    if (!xmlStrcmp(ep3, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOEP3;

    if (!bb || !xmlStrcmp(bb, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOBB;

    if (!dcnte || !xmlStrcmp(dcnte, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NODCNTE;

    if (!pcnte || !xmlStrcmp(pcnte, XC"false"))
        cur->shipgate_flags |= SHIPGATE_FLAG_NOPCNTE;

    /* For the time being, default to xbox being disabled... */
    if (xb && !xmlStrcmp(xb, XC"true"))
        cur->shipgate_flags &= ~SHIPGATE_FLAG_NOPSOX;

err:
    xmlFree(v1);
    xmlFree(v2);
    xmlFree(pc);
    xmlFree(gc);
    xmlFree(ep3);
    xmlFree(bb);
    xmlFree(dcnte);
    xmlFree(xb);
    xmlFree(pcnte);
    return rv;
}

static int handle_events(xmlNode* n, psocn_ship_t* cur) {
    int rv;
    //unsigned long rv2;
    xmlNode* n2;

    /* Make sure we don't already have an event setup done... */
    if (cur->event_count != 0) {
        ERR_LOG("忽略 %hu 行 <events> 参数", n->line);
        return 0;
    }

    /* Parse out the children of the <events> tag. */
    n2 = n->children;
    while (n2) {
        if (n2->type != XML_ELEMENT_NODE) {
            /* Ignore non-elements. */
            n2 = n2->next;
            continue;
        }
        else if (!xmlStrcmp(n2->name, XC"defaults")) {
            /* Cheat a bit here, and reuse the old <event> tag parsing code.
               Since this has to be first, that should work fine... */
            if (handle_event_old(n2, cur)) {
                rv = -1;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"event")) {
            if (handle_event(n2, cur)) {
                rv = -2;
                goto err;
            }
        }
        else {
            ERR_LOG("xml行 %hu 无效设置标签 %s",
                n2->line, (char*)n2->name);
        }

        n2 = n2->next;
    }

    rv = 0;

err:
    return rv;
}

static int handle_bbparam(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->bb_param_dir = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("bb param参数格式错误,未提供目录");
    return -1;
}

static int handle_v2param(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->v2_param_dir = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("v2 param参数格式错误,未提供目录");
    return -1;
}

static int handle_bbmaps(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->bb_map_dir = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("bb maps参数格式错误,未提供目录");
    return -1;
}

static int handle_itempt(xmlNode* n, psocn_ship_t* cur) {
    /* Grab the ptdata filenames */
    cur->v2_ptdata_file = (char*)xmlGetProp(n, XC"v2");
    cur->gc_ptdata_file = (char*)xmlGetProp(n, XC"gc");
    cur->bb_ptdata_file = (char*)xmlGetProp(n, XC"bb");

    return 0;
}

static int handle_v2maps(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->v2_map_dir = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("v2 maps参数格式错误,未提供目录");
    return -1;
}

static int handle_gcmaps(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->gc_map_dir = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("GC maps参数格式错误,未提供目录");
    return -1;
}

static int handle_itempmt(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* limit;

    /* Grab the pmtdata filenames */
    cur->v2_pmtdata_file = (char*)xmlGetProp(n, XC"v2");
    cur->gc_pmtdata_file = (char*)xmlGetProp(n, XC"gc");
    cur->bb_pmtdata_file = (char*)xmlGetProp(n, XC"bb");

    /* See if we're supposed to cap unit +/- values like the client does... */
    limit = xmlGetProp(n, XC"limitv2units");
    if (!limit || !xmlStrcmp(limit, XC"true"))
        cur->local_flags |= PSOCN_SHIP_PMT_LIMITV2;

    xmlFree(limit);

    limit = xmlGetProp(n, XC"limitgcunits");
    if (!limit || !xmlStrcmp(limit, XC"true"))
        cur->local_flags |= PSOCN_SHIP_PMT_LIMITGC;

    xmlFree(limit);

    limit = xmlGetProp(n, XC"limitbbunits");
    if (!limit || !xmlStrcmp(limit, XC"true"))
        cur->local_flags |= PSOCN_SHIP_PMT_LIMITBB;

    xmlFree(limit);

    return 0;
}

static int handle_itemrt(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* quest;

    /* Grab the rtdata filenames */
    cur->v2_rtdata_file = (char*)xmlGetProp(n, XC"v2");
    cur->gc_rtdata_file = (char*)xmlGetProp(n, XC"gc");
    cur->bb_rtdata_file = (char*)xmlGetProp(n, XC"bb");

    quest = xmlGetProp(n, XC"questrares");

    /* See if we're supposed to disable quest rares globally. */
    if (quest) {
        if (!xmlStrcmp(quest, XC"true"))
            cur->local_flags |= PSOCN_SHIP_QUEST_RARES |
            PSOCN_SHIP_QUEST_SRARES;
        else if (!xmlStrcmp(quest, XC"partial"))
            cur->local_flags |= PSOCN_SHIP_QUEST_SRARES;
    }

    xmlFree(quest);

    return 0;
}

static int handle_smutdata(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"file"))) {
        cur->smutdata_file = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("smutdata参数格式错误,未提供目录");
    return -1;
}

static int handle_mageditdata(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"file"))) {
        cur->mageditdata_file = (char*)fn;
        return 0;
    }

    /* If we don't have it, report the error */
    ERR_LOG("mageditdata参数格式错误,未提供目录");
    return -1;
}

static int handle_ship(xmlNode* n, psocn_ship_t* cur) {
    xmlChar* name, * blocks, * gms, * menu, * gmonly, * priv;
    int rv;
    unsigned long rv2;
    xmlNode* n2;

    /* Grab the attributes of the <ship> tag. */
    name = xmlGetProp(n, XC"name");
    blocks = xmlGetProp(n, XC"blocks");
    gms = xmlGetProp(n, XC"gms");
    gmonly = xmlGetProp(n, XC"gmonly");
    menu = xmlGetProp(n, XC"menu");
    priv = xmlGetProp(n, XC"privileges");

    if (!name || !blocks|| !gms || !gmonly || !menu) {
        ERR_LOG("缺少舰船的必需设置");
        rv = -1;
        goto err;
    }

