Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig_ship.c
    /* Copy out the strings out that we need */
    cur->name = (char*)name;
    cur->gm_file = (char*)gms;

    /* Copy out the gmonly flag */
    if (!xmlStrcmp(gmonly, XC"true")) {
        cur->shipgate_flags |= SHIPGATE_FLAG_GMONLY;
    }

    /* Grab the menu code */
    rv = xmlStrlen(menu);

    //printf("rv = %d isalpha(menu[0]) = %d isalpha(menu[1]) = %d\n", rv, isalpha(menu[0]), isalpha(menu[1]));

    if (rv == 2 && isalpha(menu[0]) && isalpha(menu[1])) {
        cur->menu_code = ((uint16_t)menu[0]) | (((uint16_t)(menu[1])) << 8);
    }
    else if (rv) {
        ERR_LOG("无效 menu code");
        rv = -2;
        goto err;
    }

    /* Copy out the number of blocks */
    rv2 = strtoul((char*)blocks, NULL, 0);

    if (rv2 == 0 || rv2 > 16) {
        ERR_LOG("无效舰仓数量: %s", (char*)blocks);
        rv = -3;
        goto err;
    }

    cur->blocks = (int)rv2;

    /* Parse out the privilege level, if one is provided. */
    if (priv) {
        errno = 0;
        rv2 = strtoul((char*)priv, NULL, 0);

        if (errno) {
            ERR_LOG("设置的权限级别无效: %s",
                (char*)priv);
            rv = -22;
            goto err;
        }

        cur->privileges = (uint32_t)rv2;
    }

    /* Parse out the children of the <ship> tag. */
    n2 = n->children;
    while (n2) {
        if (n2->type != XML_ELEMENT_NODE) {
            /* Ignore non-elements. */
            n2 = n2->next;
            continue;
        }
        else if (!xmlStrcmp(n2->name, XC"net")) {
            if (handle_net(n2, cur)) {
                rv = -3;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"event")) {
            if (handle_event_old(n2, cur)) {
                rv = -4;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"magnification")) {
            if (handle_magnification(n2, cur)) {
                rv = -5;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"info")) {
            if (handle_info(n2, cur, 0)) {
                rv = -6;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"quests")) {
            if (handle_quests(n2, cur)) {
                rv = -7;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"limits")) {
            if (handle_limits(n2, cur)) {
                rv = -8;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"motd")) {
            if (handle_info(n2, cur, 1)) {
                rv = -9;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"versions")) {
            if (handle_versions(n2, cur)) {
                rv = -10;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"bans")) {
            if (handle_bans(n2, cur)) {
                rv = -11;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"scripts")) {
            if (handle_scripts(n2, cur)) {
                rv = -12;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"events")) {
            if (handle_events(n2, cur)) {
                rv = -13;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"bbparam")) {
            if (handle_bbparam(n2, cur)) {
                rv = -14;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"bbmaps")) {
            if (handle_bbmaps(n2, cur)) {
                rv = -15;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"itempt")) {
            if (handle_itempt(n2, cur)) {
                rv = -16;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"v2maps")) {
            if (handle_v2maps(n2, cur)) {
                rv = -17;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"itempmt")) {
            if (handle_itempmt(n2, cur)) {
                rv = -18;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"itemrt")) {
            if (handle_itemrt(n2, cur)) {
                rv = -19;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"gcmaps")) {
            if (handle_gcmaps(n2, cur)) {
                rv = -20;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"v2param")) {
            if (handle_v2param(n2, cur)) {
                rv = -21;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"smutdata")) {
            if (handle_smutdata(n2, cur)) {
                rv = -22;
                goto err;
            }
        }
        else if (!xmlStrcmp(n2->name, XC"mageditdata")) {
            if (handle_mageditdata(n2, cur)) {
                rv = -23;
                goto err;
            }
        }
        else {
            ERR_LOG("xml行 %hu 无效设置标签 %s ",
                n2->line, (char*)n2->name);
        }

        n2 = n2->next;
    }

    rv = 0;

err:
    xmlFree(blocks);
    xmlFree(gmonly);
    xmlFree(menu);
    return rv;
}

int psocn_read_ship_config(const char* f, psocn_ship_t** cfg) {
    xmlParserCtxtPtr cxt;
    xmlDoc* doc;
    xmlNode* n;
    psocn_ship_t* rv;
    int irv = 0;
    static int have_initted = 0;

    if (!have_initted)
        xmlInitParser();

    /* Allocate space for the base of the config. */
    rv = (psocn_ship_t*)malloc(sizeof(psocn_ship_t));

    if (!rv) {
        *cfg = NULL;
        ERR_LOG("无法为舰船设置分配内存空间");
        perror("malloc");
        return -1;
    }

    /* Clear out the config. */
    memset(rv, 0, sizeof(psocn_ship_t));

    /* Allocate space for the default event. */
    rv->events = (psocn_event_t*)malloc(sizeof(psocn_event_t));
    if (!rv->events) {
        *cfg = NULL;
        free_safe(rv);
        ERR_LOG("无法为节日事件分配内存空间: %s",
            strerror(errno));
        return -1;
    }

    memset(rv->events, 0, sizeof(psocn_event_t));

    rv->limits_default = -1;
    rv->shipgate_flags |= SHIPGATE_FLAG_NOPSOX;

