Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig_ship.c
    /* Create an XML Parsing context */
    cxt = xmlNewParserCtxt();
    if (!cxt) {
        ERR_LOG("无法分析舰船设置");
        irv = -2;
        goto err;
    }

    /* Open the configuration file for reading. */
    if (f) {
        doc = xmlReadFile(f, NULL, XML_PARSE_DTDVALID);
    }
    else {
        doc = xmlReadFile(psocn_ship_cfg, NULL, XML_PARSE_DTDVALID);
    }

    if (!doc) {
        xmlParserError(cxt, "分析舰船配置文件错误");
        irv = -3;
        goto err_cxt;
    }

    /* Make sure the document validated properly. */
    if (!cxt->valid) {
        xmlParserValidityError(cxt, "无效舰船配置文件");
        irv = -4;
        goto err_doc;
    }

    /* If we've gotten this far, we have a valid document, now go through and
       add in entries for everything... */
    n = xmlDocGetRootElement(doc);

    if (!n) {
        ERR_LOG("舰船配置文件为空");
        irv = -5;
        goto err_doc;
    }

    /* Make sure the config looks sane. */
    if (xmlStrcmp(n->name, XC"psocn_ship_config")) {
        ERR_LOG("舰船配置文件类型错误");
        irv = -6;
        goto err_doc;
    }

    n = n->children;
    while (n) {
        if (n->type != XML_ELEMENT_NODE) {
            /* Ignore non-elements. */
            n = n->next;
            continue;
        }
        else if (!xmlStrcmp(n->name, XC"shipgate")) {
            if (handle_shipgate(n, rv)) {
                irv = -7;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"ship")) {
            if (handle_ship(n, rv)) {
                irv = -8;
                goto err_doc;
            }
        }
        else {
            ERR_LOG("%hu 行的设置 %s 无效"
                , n->line, (char*)n->name);
        }

        n = n->next;
    }

    /* Did we configure a set of events, or just the default? */
    if (rv->event_count == 0)
        rv->event_count = 1;

    /* Did we configure limits files, but no default? */
    if (rv->limits_count && rv->limits_default == -1)
        rv->limits_default = 0;

    *cfg = rv;

    /* Cleanup/error handling below... */
err_doc:
    xmlFreeDoc(doc);
err_cxt:
    xmlFreeParserCtxt(cxt);
    xmlCleanupParser();

err:
    if (irv && irv > -7) {
        free_safe(rv);
        *cfg = NULL;
    }
    else if (irv) {
        psocn_free_ship_config(rv);
        *cfg = NULL;
    }

    return irv;
}

void psocn_free_ship_config(psocn_ship_t* cfg) {
    int j;

    /* Make sure we actually have a valid configuration pointer. */
    if (cfg) {
        if (cfg->info_files) {
            for (j = 0; j < cfg->info_file_count; ++j) {
                xmlFree(cfg->info_files[j].desc);
                xmlFree(cfg->info_files[j].filename);
            }

            free_safe(cfg->info_files);
        }

        if (cfg->limits) {
            for (j = 0; j < cfg->limits_count; ++j) {
                xmlFree(cfg->limits[j].filename);
                xmlFree(cfg->limits[j].name);
            }

            free_safe(cfg->limits);
        }

        xmlFree(cfg->name);
        xmlFree(cfg->gm_file);
        xmlFree(cfg->quests_file);
        xmlFree(cfg->quests_dir);
        xmlFree(cfg->bans_file);
        xmlFree(cfg->scripts_file);
        xmlFree(cfg->shipgate_ca);
        xmlFree(cfg->ship_key);
        xmlFree(cfg->ship_cert);
        xmlFree(cfg->bb_param_dir);
        xmlFree(cfg->v2_param_dir);
        xmlFree(cfg->bb_map_dir);
        xmlFree(cfg->v2_map_dir);
        xmlFree(cfg->gc_map_dir);
        xmlFree(cfg->shipgate_host);
        xmlFree(cfg->ship_host4);
        xmlFree(cfg->ship_host6);
        xmlFree(cfg->v2_ptdata_file);
        xmlFree(cfg->gc_ptdata_file);
        xmlFree(cfg->bb_ptdata_file);
        xmlFree(cfg->v2_pmtdata_file);
        xmlFree(cfg->gc_pmtdata_file);
        xmlFree(cfg->bb_pmtdata_file);
        xmlFree(cfg->v2_rtdata_file);
        xmlFree(cfg->gc_rtdata_file);
        xmlFree(cfg->bb_rtdata_file);
        xmlFree(cfg->smutdata_file);

        free_safe(cfg->events);

        /* Clean up the base structure. */
        free_safe(cfg);
    }
}